-- MySQL dump 10.13  Distrib 8.0.21, for Win64 (x86_64)
--
-- Host: localhost    Database: poem
-- ------------------------------------------------------
-- Server version	8.0.21

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `countrychoose`
--

DROP TABLE IF EXISTS `countrychoose`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `countrychoose` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(255) DEFAULT NULL,
  `optionA` varchar(255) DEFAULT NULL,
  `optionB` varchar(255) DEFAULT NULL,
  `optionC` varchar(255) DEFAULT NULL,
  `optionD` varchar(255) DEFAULT NULL,
  `answer` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=54 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `countrychoose`
--

LOCK TABLES `countrychoose` WRITE;
/*!40000 ALTER TABLE `countrychoose` DISABLE KEYS */;
INSERT INTO `countrychoose` VALUES (1,'“舰旗猎猎，铁骨铮铮，享太平盛世乐逍遥”出自毛泽东的？()','A.沁园春长沙','B.沁园春祖国颂','C.七律长征','','b'),(2,'“忆昔开元全盛日，小邑犹藏万家室”语出？的忆昔二首()','A.杜甫','B.辛弃疾','C.李白','','a'),(3,'陆游的《示儿》中表达浓浓的希望国家统一富强的一句诗是?()','A.忍泪失声问使者：几时真有六军来','B.遗民泪尽胡尘里，南望王师又一年','C.王师北定中原日，家祭无忘告乃翁','','c'),(4,'“吁嗟秦皇帝，安得不富强。”语出？的《上田侍制》?()','A.苏洵','B.苏轼','C.苏辙','','a'),(5,'天下之权,________?()','A.惟民主是主','B.尽是王权','C.民主共和','','a'),(6,'四万万众，坚决抵抗。__________，改革内政?()','A.团结一心','B.勇攀高峰','C.民主共和','','c'),(7,'今天降大厉，不如罚殛我身，_____________?()','A.使至尊永为民主','B.以示天下','C.来助助兴','','a'),(8,'民主制度，_________?()','A.人权自由','B.天下之公理','C.皆为陛下所成就','','b'),(9,'自古已来，能除民害为百姓所归者，________?()','A.即民主也','B.即王权也','C.即天下也','','a'),(10,'一代风流，_______，为报苍天争自由?()','A.万代风流','B.一代天骄','C.千古风流','','c'),(11,'《项亭》中汪遵谴责了谁固执地采用暴力.不修仁德的战略思想?()','A.嬴政','B.姬胡','C.项羽','D.胡亥','c'),(12,'“汉室鸿儒盛，邹堂大义明”中的“鸿儒”是什么意思?()','A.博学的人','B.不学无术的人','C.志向远大的人','','a'),(13,'“圣人不生，麟龙何瑞。梧桐不高，凤凰何止”是哪位诗人的思想态度?()','A.齐已','B.陶渊明','C.曹植','D.陆机','a'),(14,'“不学礼，无以立”出自?()','A.《礼记》','B.《论语》','C.《中庸》','D.《孟子》','b'),(15,'“强本而节用,则天不能贫”出自于哪位思想家?()','A.诸葛亮','B.子贡','C.荀子','D.韩非','c'),(16,'李商隐擅长写?()','A.田园诗','B.边塞诗','C.爱情诗','D.咏史诗','c'),(17,'以下哪首诗告诫人们要居安思危，处盈虑亏，枕戈待旦?()','A.《泾溪》','B.《谏逐客书》','C.《将进酒》','D.《春江花月夜》','a'),(18,'“稻花香里说丰年。听取蛙声一片”的作者辛弃疾的大部分的宋词属于哪一派?()','A.豪放派','B.婉约派','C.中立派','D.朴素派','a'),(19,'“西塞山前白鹭飞，桃花流水鳜鱼肥”的作者张志和出身于何处?()','A.长安','B.洛阳','C.苏州','D.杭州','a'),(20,'“空山新雨后,天气晚来秋”的作者王维因为诗词上的造诣被人们称为?()','A.诗仙','B.诗圣','C.诗佛','D.诗魔','c'),(21,'“山气日夕佳,飞鸟相与还”的作者陶渊明的号是什么?()','A.五柳先生','B.诗圣','C.青莲居士','D.稼轩居士','a'),(22,'“千门万户曈曈日，总把新桃换旧符”描述的是哪个节日?()','A.春节','B.中秋节','C.上元节','D.元旦节','a'),(23,'王安石是唐宋八大家之一，那么下列诗人属于唐宋八大家之一的是?()','A.李白','B.曾巩','C.陈子昂','D.王维','b'),(24,'山重水复疑无路的上一句是?()','A.丰年留客足鸡豚','B.留取丹心照汗青','C.萧鼓追随村社近','D.我辈岂是蓬蒿人','a'),(25,'“曲径通幽处，禅房花木深”的作者是?()','A.常建','B.白居易','C.张文祥','D.徐志摩','a'),(26,'“月上柳梢头，人约黄昏后”描写的是中国哪一个传统节日（）','A.中秋节','B.元宵节','C.端午节','D.七夕节','b'),(27,'秦时明月汉时关，万里长征人未还。但使龙城飞将在，不教胡马度阴山。该诗的作者是（）','A.王之涣','B.王昌龄','C.王安石','D.王维','a'),(28,'羌笛何须怨杨柳，春风不度玉门关中提及的玉门关在哪里（）','A.漠北沙地','B.新疆戈壁','C.甘肃敦煌','D.宁夏平原','c'),(29,'写下千古名句“一去二三里，烟村四五家”的著名诗人邵康杰属于我国哪个朝代','A.北宋','B.南宋','C.元朝','D.清朝','a'),(30,'《长歌行》中表达时光如梭，光阴一去不复返的诗句是（）','A.青青园中葵，朝露待日晞','B.百川东道海，何时复西归','C.常恐秋节至，坤黄华叶衰','D.少壮不努力，老大徒伤悲','b'),(31,'诗句“解落三秋叶，能开二月花”讲述的是什么力量？','A.太阳','B.月亮','C.风','D.雪','c'),(32,'唐诗《出塞》中“但是龙城飞将在，不教胡马度阴山”诗句中的龙城飞将指的是哪位英雄任务？','A.飞将军李广','B.飞大帅李毅','C.大将军霍去病','D.大将军卫青','a'),(33,'汉乐府《江南》云：“江南可采莲，莲叶何田田！鱼戏莲叶间，鱼戏莲也东，鱼戏莲叶西，鱼戏莲叶南，鱼戏莲叶北”在此情景中参照物应该选择（）','A.莲叶','B.田野','C.鱼','D.池塘','a'),(34,'被苏轼形容为“诗中有画，画中有诗”的是哪一位诗人：','A.王维','B.孟浩然','C.刘禹锡','','a'),(35,'下列对应错误的一项是：','A.王维—诗佛','B.李贺—诗鬼','C.白居易—诗狂','','c'),(36,'下列不属于田园派诗人的是：','A.陶渊明','B.孟浩然','C.王昌龄','','c'),(37,'“两小无猜”出自哪首诗：','A.李白《长干行》','B.李商隐《无题》','C.白居易《赠内》','','a'),(38,'下列诗句中完全正确的一项是：','A.家书何处达，归雁洛阳边。(王湾《次北固山下》)','B.寄书长不达，况乃未休兵。(杜甫《月夜忆舍弟》)','C.深山不见人，但闻人语响。(王维《鹿柴》)','','b'),(39,'“满城尽带黄金甲”是描写哪种花的诗句：','A.桂花','B.菊花','C.向日葵','','b'),(40,'下列对应中没有错误的一项是：','A.小时不识月，呼作白玉盘——五言律诗·李白','B.露从今夜白，月是故乡明——五言律诗·杜甫','C.海上生明月，天涯共此时——五言律诗·王勃','','b'),(41,'素有“孤篇压倒全唐”之美誉的作品是：','A.李白《梦游天姥吟留别》','B.张若虚《春江花月夜》','C.白居易《长恨歌》','','b'),(42,'毛泽东对古代诗词大家甚是偏爱，“诗最爱三李，词最合稼轩。”其中的“三李”指的是唐代的李白、李贺、李商隐；“稼轩”指的是宋代的辛弃疾。而我国历史上有“词家三李”，请问，这“三李”指的又是哪三位？（）','A.李璟、李煜、李清照','B.李煜、李之仪、李重元','C.李白、李煜、李清照','','c'),(43,'《一帘幽梦》是琼瑶的代表作品之一，后来被拍成电视剧。其中的片名“一帘幽梦”出自名句“夜月一帘幽梦，春风十里柔情”。请问，这句词的作者是谁？（）','A.秦观','B.张先','C晏几道','','a'),(44,'被李白称赞为“一夫当关、万夫莫开”的雄关，是哪个关口？（）','A.山海关','B.雁门关','C.剑门关','','c'),(45,'杜甫的《丽人行》“黄门飞鞚不动尘，御厨络绎送八珍”中的“黄门”指的是什么人？（）','A.皇亲国戚','B.士族门阀','C.宦官','','c'),(46,'李白的《行路难》“闲来垂钓碧溪上，忽复乘舟梦日边”，其中的“闲来”句式化用了先秦时期的什么典故？（）','A.庄子垂钓拒聘','B.姜太公钓鱼愿者上钩','C.任公子巨钩垂钓','','b'),(47,'白居易的《赋得古原草送别》，诗名中为什么要加“赋得”二字？()','A.应考习作','B.诗的格律要求','C.诗人自己的习惯','','a'),(48,'白居易初到长安的时候，带着自己的诗作谒见知名诗人顾况，顾况看到他的一首作品后大加赞赏，给予了“有才如此，居亦容易”的评价。请问，他看到的是白居易的哪首作品？（）','A.《忆江南》','B.《赋得古原草送别》','C.《钱塘湖春行》','','b'),(49,'下列哪项不是用来形容桂林山水的？（）','A.江作青罗带，山如碧玉篸','B.神护青枫岸，龙移白石湫','C.西当太白有鸟道，可以横绝峨眉巅','','c'),(50,'柳永《望海潮》“东南形胜，三吴都会，钱塘自古繁华。”中“三吴”是指（）','A、吴兴、吴郡、会稽','B、吴兴、吴郡、乌镇','C、无锡、吴郡、乌镇','D、无锡、乌镇、会稽','a'),(51,'苏轼《念奴娇·赤壁怀古》是在（）写的','A.湖北省赤壁市','B.湖北宜昌','C.湖北黄冈','D.惠州','c'),(52,'王安石写《登飞来峰》所处时间（）','A.十几岁时','B.二十岁时','C.三十岁时','D.四十岁时','c'),(53,'李白《黄鹤楼送孟浩然之广陵》”故人西辞黄鹤楼“中黄鹤楼位于（）。','A.湖北黄冈','B.湖北宜昌','C.湖北荆州','D.湖北武汉','d');
/*!40000 ALTER TABLE `countrychoose` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `countryfill`
--

DROP TABLE IF EXISTS `countryfill`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `countryfill` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(255) DEFAULT NULL,
  `answer` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `countryfill`
--

LOCK TABLES `countryfill` WRITE;
/*!40000 ALTER TABLE `countryfill` DISABLE KEYS */;
INSERT INTO `countryfill` VALUES (1,'长太息以掩涕兮，________。','哀民生之多艰'),(2,'________，不求富贵。','苟利国家\n'),(3,'________，直把杭州当汴州。','暖风熏得游人醉\n'),(4,'民族兴大业，________。','万众齐踊跃\n'),(5,'草草临盟誓，________。','区区务富强\n'),(6,'________，视死忽如归。','捐躯赴国难\n'),(7,'开荒南野际，守拙归园田.________，复得返自然。','久在樊笼里\n'),(8,'人既尽其才，则百事俱举；百事举矣，______________。','则富强不足谋也\n'),(9,'楚不用___而削乱，秦用商君法而富强。(《金陵酒肆留别》唐·李白)','吴起'),(10,'先天下之忧而忧，________。','后天下之乐而乐'),(11,'鸟宿池边树，僧（）月下门（中唐贾岛《题李凝幽居》）','敲'),(12,'百川东到海，___________。(《长歌行》','何时复西归'),(13,'危楼高百迟，___________。(《夜宿山寺》唐李白)','手可摘星辰'),(14,'皑如山上雪，___________。（《白头吟》卓文君）','皎若云间月'),(15,'闻君有两意，___________。（《白头吟》卓文君）','故来相决绝'),(16,'今日斗酒会，___________。（《白头吟》卓文君）','明旦沟水头'),(17,'躞蹀御沟上，___________。（《白头吟》卓文君）','沟水东西流'),(18,'凄凄复凄凄，___________。（《白头吟》卓文君）','嫁娶不须啼'),(19,'愿得一心人，___________。（《白头吟》卓文君）','白头不相离');
/*!40000 ALTER TABLE `countryfill` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `personalchoose`
--

DROP TABLE IF EXISTS `personalchoose`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `personalchoose` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(255) DEFAULT NULL,
  `optionA` varchar(255) DEFAULT NULL,
  `optionB` varchar(255) DEFAULT NULL,
  `optionC` varchar(255) DEFAULT NULL,
  `optionD` varchar(255) DEFAULT NULL,
  `answer` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `personalchoose`
--

LOCK TABLES `personalchoose` WRITE;
/*!40000 ALTER TABLE `personalchoose` DISABLE KEYS */;
INSERT INTO `personalchoose` VALUES (1,'但使龙城飞将在，----------。','A.不教胡马度阴山','B.万里长征人未还','C.家祭无忘告乃翁','D.但悲不见九州同','a'),(2,'《渔家傲·塞下秋来风景异》的作者是-朝---。','A.元，范仲淹','B.宋，范仲淹','C.宋，苏轼','D.唐，李白','b'),(3,'下列那句诗不属于《离骚》？','A.何桀纣之猖披兮，夫惟捷径以窘步','B.宁溘死以流亡兮，余不忍为此态也','C.长太息以掩涕兮，哀民生之多艰','D.何必一日之内，弃骓兮而别虞兮','d'),(4,'下列那句诗没有体现爱国情怀？','A.会当凌绝顶，一览众山小','B.商女不知亡国恨，隔江犹唱后庭花','C.人生自古谁无死，留取丹心照汗青','D.毅魄归来日，灵旗空际看','a'),(5,'出师一表真名世，千载谁刊伯仲间”是哪位诗人所写？','A.陆游','B.林升','C.龚自珍','D.辛弃疾','a'),(6,'下列属于爱国诗的是？','A.醉翁亭记','B.秋思','C.白头吟','D.满江红·写怀','d'),(7,'《过零丁洋》宋·文天祥“辛苦遭逢起一经，干戈寥落四周星。”说明文天祥遭遇了什么？','A.战争','B.科举入仕','C.亲人离世','D.陷害入狱','b'),(8,'“感时花溅泪，恨别鸟惊心。”中“恨”代表着什么感情？','A.憎恨','B.不舍','C.讨厌','D.讨厌','b'),(9,'\"莫等闲，白了少年头，空悲切”中莫等去做什么事情？','A.建功立业','B.入仕当官','C.铲除奸佞','D.树立志向','a'),(10,'志不强者智不达，下一句是（）。','A.A.	言不信者行不果','B.但见丹城赤如血','C.谁知伪言巧如簧','','a'),(11,'下面哪一句与诚信无关（）。','A.内外相应，言行相称。','B.善不由外来兮，名不可以虚作。','C.今我不乐，日月其除','','c'),(12,'“自古驱民在信诚，一言为重百金轻”主要是写（）。','A.忠诚','B.诚信','C.友善','','b'),(13,'“人而无信，不知其可也”出自().','A.墨子','B.孔子','C.孟子','','b'),(14,'\"精诚所至\"，下一句（）','A.金石为亏','B.金石为开','C.诚之所感','','b'),(15,'”君子乾乾不息于诚”出自（）','A.宋·周敦颐《通书·乾坤益动》','B.明·朱之瑜《诚诚二首》','C.明·洪自诚《菜根谭》','','a'),(16,'”廉者憎贪，信者疾伪”中“信”是指（）','A.信任','B.信用','C.诚实','','c'),(17,'“华而不实，虚而无用”出自（）','A.《颜氏家训·名实篇》','B.《潮州韩文公庙碑》','C.《韩非子·难言》','','c'),(18,'“善不由外来兮，名不可以虚作”是谁写的（）','A.屈原','B.李白','C.杜甫','','a'),(19,'“城阙辅三秦，风烟望五津。”中的城阙在诗词中代指什么？','A.边塞','B.家乡','C.京城','','c'),(20,'“霁日园林好，清明烟火新。”中的霁日指的是哪种天气？','A.晴转多云','B.雨后天晴','C.阴天','','b'),(21,'杜甫被后人称为？','A.诗仙','B.诗圣','C.诗鬼','','b'),(22,'以下哪一个不是古诗中对友人的称呼？','A.哲嗣','B.同袍','C.同窗','','a'),(23,'五柳先生诗哪位诗人的号？','A.白居易','B.张九龄','C.陶渊明','','c'),(24,'人生自古谁无死，留取丹心照（）。是文天祥的诗句。','A.汗青','B.汉青','C.汗清','','a'),(25,'（），小人怀惠。','A.君子怀刑','B.君子怀德','C.君子怀心','','a'),(26,'李商隐在《无题》中写道：“走马兰台类转蓬”，其中“兰台”是指：','A.秘书省的别称','B.中书省的别称','C.尚书省的别称','D.枢密院的别称','a'),(27,'泽国江山入战图，_______。','A.生民何计乐樵苏','B.难民何计乐樵苏','C.平民何计乐樵苏','','a'),(28,'曰仁义，___，此五常，不容紊。','A.智礼信','B.智信礼','C.礼智信','','c'),(29,'下列对应中没有错误的一项是：','A．小时不识月，呼作白玉盘——五言律诗·李白','B．露从今夜白，月是故乡明——五言律诗·杜甫','C．海上生明月，天涯共此时——五言律诗·王勃','','b'),(30,'下列哪一句出自刘希夷的《代悲白头翁》：','A．今年欢笑复明年，秋月春风等闲度。','B．人生代代无穷已，江月年年只相似。','C．年年岁岁花相似，岁岁年年人不同。','','c'),(31,'无为有岐路，儿女共沾襟”中哪一个字是错的？','A、为——违','B、岐——其','C、襟——巾','','c'),(32,'从“故人西辞黄鹤楼”中“西辞”二字来看，作者的朋友要往哪里去？','A、向东去','B、向西去','C、辞别西方向黄鹤楼去','','a'),(33,'洛阳访才子，江岭做流人。闻说梅花早，何如此地春。作者是()','A.李白','B.孟浩然','C.王维','','b'),(34,'白日依山尽，黄河入海流。欲穷千里目，更上一层楼。作者是()','A.王昌龄','B.贺知章','C.王之涣','','c'),(35,'打起黄莺儿，莫教枝上啼。啼时惊妾梦，不得到辽西。()','A.盖嘉运','B.孟浩然','C.高适','','a'),(36,'众鸟高飞尽，孤云独去闲。相看两不厌，只有敬亭山。()','A.杜甫','B.刘克庄','C.李白','','c'),(37,'松下问童子，言师采药去。只在此山中，云深不知处。()','A.韦应物','B.孟郊','C.贾岛','','c'),(38,'春眠不觉晓，处处闻啼鸟。夜来风雨声，花落知多少。()','A.孟浩然','B.杜甫','C.苏东坡','','a'),(39,'君家住何处，妾住在横塘。停船暂借问，或恐是同乡。()','A.王维','B.孟浩然','C.崔顥','','c'),(40,'床前明月光，疑是地上霜。举头望明月，低头思故乡。()','A.杜甫','B.李白','C.王维','','b'),(41,'下列诗句，哪一项是正确的？','A、朱弦已为佳人绝，醉眼聊因美酒横。','B、朱弦已为佳人绝，老眼聊因美酒横。','C、朱弦已为佳人绝，青眼聊因美酒横。','','c'),(42,'请问“挥手自兹去，萧萧班马鸣”中“班马”指什么？','A、有花纹的马','B、离群的马','C、以班固、司马迁喻人','','b'),(43,'白居易《问刘十九》诗有“绿蚁新醅酒，红泥小火炉”句，请问诗中的“绿蚁”指的是什么？','A、酒上浮起的绿色泡沫','B、绿色的蚂蚁','C、茶','','a'),(44,'下列诗句中哪一句与春天无关：','A．渡头余落日，虚里上孤烟。','B．泥融飞燕子，沙暖睡鸳鸯。','C．随风潜入夜，润物细无声。','','a'),(45,'下列诗句,哪一项是正确的？（）','A、休说鲈鱼滋味，尽西风，季鹰归未？','B、休说鲤鱼滋味，尽西风，季鹰归未？','C、休说鲈鱼堪鲙，尽西风，季鹰归未','','c'),(46,'李清照《如梦令》中“知否？知否？应该是绿肥红瘦”，这里的“红瘦”是指什么花？（）','A、牡丹','B、芍药','C、海棠','','c'),(47,'一道残阳铺水中，半江瑟瑟半江红”中“瑟瑟”是什么意思？（）','A、碧绿','B、寒冷','C、寂寥','','a'),(48,'李白《夜泊牛渚怀古》：“登舟望秋月，空忆谢将军”中“谢将军”指的是谁？（）','A、谢安','B、谢尚','C、谢玄','','b'),(49,'下列诗句中哪一项是正确的？（）','A、兴尽晚回舟，误入莲花深处。','B、兴尽晚回舟，误入藕花深处。','C、兴尽晚回舟，误入荷花深处。','','b'),(50,'杨万里“接天莲叶无穷碧，映日荷花别样红”描写的是哪里的荷花？（）','A、无锡太湖','B、扬州瘦西湖','C、杭州西湖','','c'),(51,'“陈王昔时宴平乐，斗酒十千恣欢谑”中的“陈王”是谁？（）','A、陈胜','B、曹植','C、陈叔宝','','b'),(52,'以下词牌名中含有人物的是哪一个？（）','A、生查子','B、木兰花慢','C、念奴娇','','c');
/*!40000 ALTER TABLE `personalchoose` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `personalfill`
--

DROP TABLE IF EXISTS `personalfill`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `personalfill` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(255) DEFAULT NULL,
  `answer` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `personalfill`
--

LOCK TABLES `personalfill` WRITE;
/*!40000 ALTER TABLE `personalfill` DISABLE KEYS */;
INSERT INTO `personalfill` VALUES (1,'花径不曾缘客扫，________','蓬门今始为君开\n'),(2,'________，落日故人情。','浮云游子意\n'),(3,'我寄愁心与明月，________','随风直到夜郎西\n'),(4,'海内存知己，________','天涯若比邻\n'),(5,'________，报之以李。','投我以桃\n'),(6,'春蚕到死丝方尽，_______','蜡炬成灰泪始干\n'),(7,'_______,长使英雄泪满襟。','出师未捷身先死'),(8,'_______,肯将衰朽惜残年。','欲为圣明除弊事'),(9,'零落成泥碾作尘，_______','只有香如故\n'),(10,'南过猿声一逐臣，_______','回看秋草泪沾巾'),(11,'白发渔樵江渚上，____________。（《临江仙》杨慎）','惯看秋月春风'),(12,'___________，听唱新翻杨柳枝。（《杨柳枝词九首·其一》唐刘禹锡）','塞北梅花羌笛吹'),(13,'___________，霜重鼓寒声不起。（《雁门太守行》唐李贺','黑云压城城欲摧'),(14,'________________，白银盘里一青螺。(《望洞庭》唐·刘禹锡)','遥望洞庭山水色'),(15,'______________，烈火焚烧若等闲。《石灰吟》明·于谦','千锤万凿出深山'),(16,'生当作人杰，_________','死亦为鬼雄'),(17,'气蒸云梦泽，_________','波撼岳阳城'),(18,'黄尘清水三山下，_________。（《梦天》唐李贺','更变千年如走马）'),(19,'________，坐看云起时。（《终南别业/初至山中》唐王维','行至水穷处）'),(20,'《秋浦歌十七首》其十四炉火照天地\"的下一句是__________','红星乱紫烟'),(21,'杜牧《山行》\"远上寒山石径斜“正确的下句是什么__________','白云深处有人家');
/*!40000 ALTER TABLE `personalfill` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `socialchoose`
--

DROP TABLE IF EXISTS `socialchoose`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `socialchoose` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(255) DEFAULT NULL,
  `optionA` varchar(255) DEFAULT NULL,
  `optionB` varchar(255) DEFAULT NULL,
  `optionC` varchar(255) DEFAULT NULL,
  `optionD` varchar(255) DEFAULT NULL,
  `answer` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=54 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `socialchoose`
--

LOCK TABLES `socialchoose` WRITE;
/*!40000 ALTER TABLE `socialchoose` DISABLE KEYS */;
INSERT INTO `socialchoose` VALUES (1,'以下哪个是于谦的作品？','A《石灰吟》','B《长歌行》','C《秋怀》','','a'),(2,'“下狱戴枷遭责罚，更须枉费几文钱。”出自哪首诗？','A《寄卢仝》','B《石鼓》','C《莫争打》','D《论俗诗四首》','d'),(3,'诗句“平而后清，清而后明”形容的是？','A水','B月亮','C火','','a'),(4,'诗词《满江红》的作者是？','A文天祥','B岳飞','C李白','','b'),(5,'方孝孺的《杂铭》中”公其心，万善出“是什么意思？','A出自于公心，就会做出许许多多好事。','B你的心是公正的，那么别人就会多做善事。','C水在平静不动后才见清澈，清澈以后才见光明。','','a'),(6,'《出师表》是诸葛亮写给谁的？','A.刘禅','B.刘备','C.赵子龙','','a'),(7,'张九龄在《感遇·江南有丹橘》诗中描述了橘树，其意在？','A.抒发了自己不遇之痛，表达对当朝皇帝昏庸的厌恶','B.赞美橘树，感叹橘树之美','C.为橘树平反，不与权贵者同污，向往、追求着官场上的公平','','c'),(8,'日长篱落无人过，___________。--四时田园杂兴(范成大)','A.早有蜻蜓立上头','B.知有儿童挑促织','C.惟有蜻蜓蛱蝶飞','D.才了蚕桑又插田','c'),(9,'小娃撑小艇，__________。--池上(白居易)','A.秋收万颗子','B.偷采白莲回','C.出没风波里','D.忽然闭口立','b'),(10,'“运命惟所遇,循环不可寻”一句出自哪首诗？','A．《感遇十二首·其一》','B.《感遇·江南有丹橘》','C.《西江夜行》','','b'),(11,'下列选项中哪个不是陶渊明的作品?','A．《桃花源记》','B.《饮酒·幽兰生前庭》','C.《将进酒·君不见》','','c'),(12,'“安能摧眉折腰事权贵？使我不得开心颜”出自李白的哪个作品？','A.《梦游天姥吟留别》','B.《黄鹤楼送孟浩然之广陵》','C.《早发白帝城》','','a'),(13,'出自魏晋陶渊明的《归园田居·其一》中“羁鸟恋旧林，池鱼思故渊。”羁鸟的意思是','A.自由飞翔的鸟','B.笼中之鸟','C.秃鹫','','b'),(14,'以下哪位诗人是中国的第一位田园诗人?','A.陶渊明','B.孟浩然','C.韦应物','','a'),(15,'在陶渊明（魏晋）的《归鸟·其二》中的诗句“翼翼归鸟，载翔载飞。”的意思是','A.归鸟翩翩自在飞，自由翱翔任飞飞','B.鸟儿张开翅膀漫无目的的飞着，收获满满地飞回巢穴','C.归巢的鸟儿小心翼翼的飞着，自由自在地飞翔着','','a'),(16,'“此虽法律所无奈，尚可仰首披苍旻”。这首《自尤》是宋代著名诗人苏轼的父亲（）所写。','A苏洵','B、苏澈','C、苏舜卿','D、苏源明','a'),(17,'《戏子由》宋:苏轼“读书万卷不读律，致君尧舜知无术“。是什么意思（）。','A、读书万卷却不读法律，导致君主尧舜不学无术。','B、书读得再多，不读律书，也没有办法辅佐君主做像尧舜那样的贤明君主。','C、书读了很多却不学习律书，导致君主知道的很少。','D、读了很多书却不读律书，导致君主不能像舜尧一样知道很多。','b'),(18,'《秋怀》“兴怀徒寄广武叹，薄福不挂云台名。颔须白尽愈落寞，始读法律亲笞榜“是南宋著名爱国诗人（）所著。','A、苏轼','B、杜甫','C、陆游','D、屈原','c'),(19,'分别号称“诗仙“”诗圣“”诗鬼“的诗人是（）。','A、李贺、杜甫、李商隐','B、李白、李贺、杜甫','C、李白、杜甫、李贺','D、李白、杜甫、李商隐','c'),(20,'《寄卢仝》“彼皆刺口论世事，有力未免遭驱使。先生事业不可量，惟用法律自绳己“是唐宋八大家之首（）所写。','A、韩愈','B、曾巩','C、柳宗元','D、苏轼','a'),(21,'王安石曾写诗赞扬一位历史人物的政治功绩，表达自己的政治诉求：“自古驱民在信诚，一言为重百金轻。”请问他赞赏的是谁？（）','Ａ、吕不韦','Ｂ、商鞅','Ｃ、侯赢','','b'),(22,'李白的《塞下曲》中“功成画麟阁，独有霍嫖姚”的“霍嫖姚”指的是西汉名将霍去病。请问，“嫖姚”二字的含义是？（）','A霍去病的小名','B霍去病的官位','C霍去病的表字','','b'),(23,'杜甫《茅屋为秋风所破歌》中“吾庐独破受冻死亦足”中“吾庐“位于（）。','A.四川绵阳','B.四川成都','C.四川泸州','D.四川达州','b'),(24,'王维在上元二年上书《责躬荐弟表》请求削去自己一生所任最高的（）官职，放归田园。','A.太子中允','B.中书舍人','C.监察御史','D.尚书右丞','d'),(25,'李贺《金铜仙人辞汉歌》”茂陵刘郎秋风客，夜闻马嘶哓无迹“句中”茂陵指（）的陵墓。','A.汉高祖刘邦','B.汉武帝刘彻','C.汉光武帝刘秀','D.汉文帝刘恒','b'),(26,'《孔雀东南飞》“便可白公母，及时相遣归。”中“白”的意思是（）。','A.明白','B.白眼','C.告诉','D.徒然的','c'),(27,'柳永《望海潮》“东南形胜，三吴都会，钱塘自古繁华。”中“三吴”是指（）','A、吴兴、吴郡、会稽','B、吴兴、吴郡、乌镇','C、无锡、吴郡、乌镇','D、无锡、乌镇、会稽','a'),(28,'苏轼《念奴娇·赤壁怀古》是在（）写的','A.湖北省赤壁市','B.湖北宜昌','C.湖北黄冈','D.惠州','c'),(29,'王安石写《登飞来峰》所处时间（）','A.十几岁时','B.二十岁时','C.三十岁时','D.四十岁时','c'),(30,'李白《黄鹤楼送孟浩然之广陵》”故人西辞黄鹤楼“中黄鹤楼位于（）。','A.湖北黄冈','B.湖北宜昌','C.湖北荆州','D.湖北武汉','d'),(31,'杜甫《茅屋为秋风所破歌》中“吾庐独破受冻死亦足”中“吾庐“位于（）。','A.四川绵阳','B.四川成都','C.四川泸州','D.四川达州','b'),(32,'王维在上元二年上书《责躬荐弟表》请求削去自己一生所任最高的（）官职，放归田园。','A.太子中允','B.中书舍人','C.监察御史','D.尚书右丞','d'),(33,'李贺《金铜仙人辞汉歌》”茂陵刘郎秋风客，夜闻马嘶哓无迹“句中”茂陵指（）的陵墓。','A.汉高祖刘邦','B.汉武帝刘彻','C.汉光武帝刘秀','D.汉文帝刘恒','b'),(34,'《孔雀东南飞》“便可白公母，及时相遣归。”中“白”的意思是（）。','A.明白','B.白眼','C.告诉','D.徒然的','c'),(35,'“白日依山尽，黄河入海流。欲穷千里目，更上一层楼。”是王之涣《登鹳雀楼》中的诗句，请问鹳雀楼在下面哪个省?()','A、山西','B、陕西','C、山东','D、江西','a'),(36,'中国古代诗歌史上流派纷呈，其中有个影响特别大的诗派叫做“江西诗派”，江西诗派有“一祖三宗”之说，请问是哪一祖?()','A、杜甫','B、黄庭坚','C、苏轼','D、贾岛','a'),(37,'下列景物中，写春天景物的是？()','A、停车坐爱枫林晚，霜叶红于二月花','B、荷风送香气，竹露滴清响','C、渭城朝雨浥轻尘，客舍清清柳色新','D、柴门闻犬吠，风雪夜归人','c'),(38,'下列评语中，提到诗人王维的是？()','A、味摩诘之诗，诗中有画','B、尤标绝句，深情幽怨，意旨微茫','C、诗骨耸东野，诗涛涌退之','D、樊川诗雄姿英发，樊南诗深情绵邈','a'),(39,'我们通常将男女新婚之夜说成“春宵一刻值千金”，其实这句诗是劝人们及时学习的。请问，这句诗出自何人之手?()','A、苏轼','B、秦观','C、陆游','D、杨万里','a'),(40,'李白笔下的“飞流直下三千尺，疑是银河落九天”指的是哪个风景区？()','A、华山','B、庐山','C、峨眉山','D、天姥山','b'),(41,'“已是悬崖百丈冰，犹有花枝俏”这两句词描写的是？()','A、春天景色','B、夏天景色','C、秋天景色','D、冬天景色','d'),(42,'“飞流直下三千尺，疑是银河落九天”所用的修辞手法是？()','A、夸张、比喻','B、比喻、拟人','C、夸张、借代','D、想象、回环','a'),(43,'“但使龙城飞将在，不教胡马度阴山”中的“龙城飞将”指的是？()','A、汉朝名将霍去病','B、汉朝名将李广','C、赵国名将廉颇','D、三国名将赵云','b'),(44,'下面四位都是我国唐朝杰出的诗人，其中号称“诗圣”的是？()','A、李白','B、杜甫','C、白居易','D、李商隐','b'),(45,'”滚滚长江东逝水，浪花淘尽英雄。是非成败转头空。”是（）的诗句。','A.苏轼','B.杨慎','C.辛弃疾','D.李白','b'),(46,'”皑如山上雪，皎若云间月。”是（）的诗句。','A.苏轼','B.卓文君','C.辛弃疾','D.李白','b'),(47,'\"咬定青山不放松，立根原在破岩中。千磨万击还坚劲，任尔东西南北风。\"描写的是哪种植物?','A.松树','B.梅花','C.竹子','','c'),(48,'\"合昏尚知时，鸳鸯不独宿。但见新人笑，那闻旧人哭。”中的”合昏”指的是','A.合欢花','B.夜来香','C.夕颜','','c'),(49,'\"东风不与周郎便，铜雀春深锁二乔这里的东风指的是什么?','A.水淹七军','B.草船借箭','C.火烧赤壁','','c'),(50,'以下哪句是写到祖国母亲花?','A.灿灿萱草花，罗生北堂下','B.满地芦花和我老，旧家燕子傍谁飞','C.待到重阳日，还来就菊花','','a'),(51,'《琵琶行》里没有下面那个成语','A.司马青衫','B.门前冷落','C.余音绕梁','','c'),(52,'\"飞流直下三千尺，疑是银河落九天”指的是哪个风景区?','A、华山','B、黄山','C、泰山','D、庐山','d'),(53,'李白曾经佩服的一个人，“眼前有景道不得，崔郎题诗在上头”中的诗是哪一首?','A《登鹳雀楼》','B《黄鹤楼》','C《登金陵凤凰台》','','b');
/*!40000 ALTER TABLE `socialchoose` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `socialfill`
--

DROP TABLE IF EXISTS `socialfill`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `socialfill` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(255) DEFAULT NULL,
  `answer` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `socialfill`
--

LOCK TABLES `socialfill` WRITE;
/*!40000 ALTER TABLE `socialfill` DISABLE KEYS */;
INSERT INTO `socialfill` VALUES (1,'宁为玉碎，——————。--李百药北齐书','不为瓦全\n'),(2,'粉身碎骨浑不怕，——————。--于谦','要留清白在人间\n'),(3,'人生自古谁无死，——————。--文天祥','留取丹心照汗青\n'),(4,'我自横刀向天笑，——————。--谭嗣同','去留肝胆两昆仑\n'),(5,'寄意寒星荃不察，——————。--鲁迅','我以我血荐轩辕\n'),(6,'鹰击长空，鱼翔浅底，——————。——毛泽东','万类霜天竞自由\n'),(7,'醉翁之意不在酒，——————。——欧阳修','在乎山水之间\n'),(8,'仰天大笑出门去，——————。——李白','我辈岂是蓬蒿人\n'),(9,'行到水穷处，------。--王维','坐看云起时\n'),(10,'采菊东篱下，——————。——陶渊明《饮酒·其五》','悠然见南山\n'),(11,'卫青不败由天幸，——————。——王维《老将行》','李广无功缘数奇\n'),(12,'——————。，不宜异同。——诸葛亮《出师表》','陟罚臧否\n'),(13,'有功则赏，——————。——司马光《进修心治国要札子状》','有罪则刑\n'),(14,'平而后清，——————。——宋·司马光','清而后明\n'),(15,'为公则生明，——————。——石成金《传家宝·绅瑜》','为廉则生威\n'),(16,'若有作奸犯科及为忠善者，——————，以昭陛下平明之理。——《出师表》诸葛亮','宜付有司论其刑赏\n'),(17,'贫贱畏苔榜，——————。——《长恨歌》梅尧臣','富贵拘法律\n'),(18,'君子喻于义，——————。','小人喻于利'),(19,'滚滚长江东逝水，____________。（《临江仙》杨慎）','浪花淘尽英雄');
/*!40000 ALTER TABLE `socialfill` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `students`
--

DROP TABLE IF EXISTS `students`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `students` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `schoolNum` varchar(255) DEFAULT NULL,
  `sex` varchar(20) DEFAULT NULL,
  `school` varchar(127) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=25851 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;


--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `schoolNum` varchar(255) DEFAULT NULL,
  `sex` varchar(20) DEFAULT NULL,
  `lastGrade` int DEFAULT NULL,
  `totalGrade` int DEFAULT NULL,
  `lastSubmit` varchar(20) DEFAULT NULL,
  `totalSubmit` int DEFAULT '0',
  `school` varchar(127) DEFAULT NULL,
  `CreateTime` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `today` int DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=490 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-11-05 14:55:06
